import { optionCusomSelect } from "../TYPES/TYPES";

export const dataYears = {
  "2023": "2023 год",
  "2022": "2022 год",
  "2021": "2021 год",
  "2020": "2020 год",
  "2019": "2019 год",
  "2018": "2018 год",
  "2017": "2017 год",
  "2016": "2016 год",
  "2015": "2015 год",
  "2010-2019": "2010-е",
  "2000-2009": "2000-е",
  "1990-1999": "1990-е",
  "1980-1989": "1980-е",
  "1970-1979": "1970-е",
  "1960-1969": "1960-е",
  "1950-1959": "1950-е",
  "1940-1949": "1940-е",
  "1930-1939": "1930-е",
  "1920-1929": "1920-е",
  "1910-1919": "1910-е",
  "1900-1909": "1900-е",
  "1890-1899": "1890-е",
};

export const optionsYears: optionCusomSelect[] = Object.entries(dataYears).map(([value, label]) => {
  return { value: value, label: label };
});
